MuskaanJain2021/Mastering_STM32/STM32F407VGT6_DRIVERS/I2C_DRIVER/I2C.c
/*
 * I2C.c
 *
 *
 *Author: muskaan jain
 */
#include <stm32f4xx.h>
#include "stm32f407xx.h"
#include "I2C.h"
#include "I2C_Def.h"
#include "GPIO.h"
#include "DMA.h"
#define TIMEOUT_MAX 1000
//extern I2C_Config config;

/**
 * @brief  Enables the clock for the specified I2C peripheral.
 * @param  config: Pointer to the I2C_Config structure that contains
 *         the configuration information for the I2C peripheral.
 * @note   This function sets the corresponding bit in the APB1ENR register
 *         to enable the clock for the selected I2C peripheral (I2C1, I2C2, or I2C3).
 */
void I2C_Clock_Enable(I2C_Config *config)
{
    if (config->I2Cx == I2C1)
    {
        RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
    }
    else if (config->I2Cx == I2C2)
    {
        RCC->APB1ENR |= RCC_APB1ENR_I2C2EN;
    }
    else if (config->I2Cx == I2C3)
    {
        RCC->APB1ENR |= RCC_APB1ENR_I2C3EN;
    }
}
/**
 * @brief  Disables the clock for the specified I2C peripheral.
 * @param  config: Pointer to the I2C_Config structure that contains
 *         the configuration information for the I2C peripheral.
 * @note   This function clears the corresponding bit in the APB1ENR register
 *         to disable the clock for the selected I2C peripheral (I2C1, I2C2, or I2C3).
 */
void I2C_Clock_Disable(I2C_Config *config)
{
    if (config->I2Cx == I2C1)
    {
        RCC->APB1ENR &= ~RCC_APB1ENR_I2C1EN;
    }
    else if (config->I2Cx == I2C2)
    {
        RCC->APB1ENR &= ~RCC_APB1ENR_I2C2EN;
    }
    else if (config->I2Cx == I2C3)
    {
        RCC->APB1ENR &= ~RCC_APB1ENR_I2C3EN;
    }
}
/**
 * @brief  Disables DMA requests for I2C data transfer.
 * @param  I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, I2C3).
 * @note   This function clears the DMAEN bit in the CR2 register to stop
 *         the I2C peripheral from sending DMA requests for data transfers.
 */
void I2C_DisableDMA(I2C_TypeDef *I2Cx)
{
    /* Clear DMAEN bit in CR2 register to disable DMA requests */
    CLEAR_BIT(I2Cx->CR2, I2C_CR2_DMAEN);
}

/**
 * @brief  Enables DMA requests for I2C data transfer.
 * @param  I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, I2C3).
 * @note   This function sets the DMAEN bit in the CR2 register to allow
 *         the I2C peripheral to send requests to the DMA controller for data transfers.
 */
void I2C_EnableDMA(I2C_TypeDef *I2Cx)
{

    /* Set DMAEN bit in CR2 register to enable DMA requests */
    SET_BIT(I2Cx->CR2, I2C_CR2_DMAEN);
}



/**
 * @brief Configure the acknowledgment state for the I2C peripheral.
 *
 * This function enables or disables the acknowledgment (ACK) feature in the
 * I2C communication. When enabled, the I2C peripheral will send an ACK bit
 * after receiving a byte of data. When disabled, it will send a NACK bit instead.
 *
 * @param I2Cx Pointer to the I2C peripheral base address.
 *              This should be one of the I2C instances (I2C1, I2C2, or I2C3).
 *
 * @param NewState The desired acknowledgment state.
 *                 This can be:
 *                 - ENABLE: Enable acknowledgment.
 *                 - DISABLE: Disable acknowledgment.
 *
 * @note
 *  - This function should be called before starting a data transfer to
 *    ensure the acknowledgment state is set correctly.
 *  - Acknowledgment is crucial in I2C communication to confirm data reception
 *    between the master and slave devices.
 */
void I2C_AcknowledgeConfig(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        SET_BIT(I2Cx->CR1, I2C_CR1_ACK); // Set the ACK bit in CR1 register to enable acknowledgment.
    }
    else
    {
        CLEAR_BIT(I2Cx->CR1, I2C_CR1_ACK); // Clear the ACK bit in CR1 register to disable acknowledgment.
    }
}
/**
 * @brief Clear the ADDR flag in the I2C status registers.
 *
 * This function is used to clear the Address Sent (ADDR) flag in the
 * I2C status register after the address has been acknowledged.
 * It reads the status register to clear the ADDR flag. This is
 * necessary to avoid any further interruptions in communication.
 *
 * @param I2Cx Pointer to the I2C peripheral base address.
 *              This should be one of the I2C instances (I2C1, I2C2, or I2C3).
 *
 * @note
 *  - The ADDR flag is set when an address is sent by the master or a slave address is matched
 *    in slave mode. This function must be called after the address is transmitted to clear the flag.
 *  - The ADDR flag can only be cleared by reading SR1 followed by SR2.
 */
/**
 * @brief Clears the ADDR flag in the I2C peripheral's status registers.
 *
 * This function ensures the ADDR flag is properly cleared by reading SR1 and SR2.
 * Additionally, it manages acknowledgment based on the transfer size and mode.
 *
 * @param I2Cx Pointer to the I2C peripheral base address (I2C1, I2C2, or I2C3).
 * @param config Pointer to the I2C_Config structure that holds configuration details,
 *               including the transfer state and RX size.
 */
void I2C_ClearADDRFlag(I2C_TypeDef *I2Cx, I2C_Config *config)
{
    // Check if the device is in master mode
    if (READ_BIT(I2Cx->SR2, I2C_SR2_MSL)) // MSL: Master/Slave mode
    {
        // Device is in master mode

        // Check if the current operation is a read (receiving data)
        if (config->TxRxState == I2C_BUSY_IN_RX)
        {
            // Check if only one byte is to be received
            if (config->Rxsize == 1)
            {
                // Disable acknowledgment for the last byte
                I2C_AcknowledgeConfig(I2Cx, DISABLE);
            }
        }
    }

    // Clear the ADDR flag by reading SR1 followed by SR2
    (void)I2Cx->SR1; // Read SR1 to clear the ADDR flag
    (void)I2Cx->SR2; // Read SR2 to complete the clearing process
}


/**
 * @brief  Initializes the I2C peripheral based on the provided configuration.
 * @param  config: Pointer to the I2C_Config structure that contains
 *         the configuration information for the I2C peripheral, including mode, speed,
 *         interrupt settings, DMA settings, and GPIO configurations for the SDA and SCL lines.
 *
 * @note   This function performs several tasks:
 *         - Enables the clock for the I2C peripheral.
 *         - Configures the GPIO pins for SDA and SCL lines with alternate function, open-drain mode, and pull-up resistors.
 *         - Sets the I2C communication speed based on the selected standard or fast mode.
 *         - Configures the rise time of the I2C signals.
 *         - Sets the I2C peripheral in Master or Slave mode.
 *         - Configures interrupts (Error, Event, Buffer) and DMA control if enabled.
 *         - Enables or disables clock stretching in Slave mode.
 *         - Enables the I2C peripheral after configuration.
 */
void I2C_Init(I2C_Config *config)
{
    /* Enable the I2C Clock */
    I2C_Clock_Enable(config);

    /* Configure GPIO for SDA and SCL pins */
    if (config->I2Cx == I2C1)
    {
        GPIO_Pin_Init(GPIOB, I2C1_Pins[0].SCL.pinNumber, GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_UP, I2C1_Pins[0].SCL.altFunction);
        GPIO_Pin_Init(GPIOB, I2C1_Pins[0].SDA.pinNumber, GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_UP, I2C1_Pins[0].SDA.altFunction);
    }
    else if (config->I2Cx == I2C2)
    {
        GPIO_Pin_Init(GPIOB, I2C2_Pins.SCL.pinNumber,GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_NO, I2C2_Pins.SCL.altFunction);
        GPIO_Pin_Init(GPIOB, I2C2_Pins.SDA.pinNumber, GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_NO, I2C2_Pins.SDA.altFunction);
    }
    else if (config->I2Cx == I2C3)
    {
        GPIO_Pin_Init(GPIOA,I2C3_Pins.SCL.pinNumber, GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_NO, I2C3_Pins.SCL.altFunction);
        GPIO_Pin_Init(GPIOC,I2C3_Pins.SDA.pinNumber, GPIO_MODE_ALTERNATE_FUNCTION, GPIO_OUTPUT_TYPE_OPEN_DRAIN, GPIO_SPEED_HIGH, GPIO_PULL_NO, I2C3_Pins.SDA.altFunction);
    }

    /* Disable I2C Peripheral before making configurations */
    config->I2Cx->CR1 &= ~I2C_CR1_PE;

    /* Reset the I2C peripheral and disable clock stretching */
    config->I2Cx->CR1 |= I2C_CR1_SWRST | I2C_CR1_NOSTRETCH;
    config->I2Cx->CR1 &= ~I2C_CR1_SWRST;

