MuskaanJain2021/Mastering_STM32/STM32F407VGT6_DRIVERS/I2C_DRIVER/I2C.c
    /* Configure Interrupts (Disable, Error, Event, Buffer) */
    config->I2Cx->CR2 &= ~(I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN); /* Clear all interrupt bits first */
    if (config->Interrupts.Disable == 0)                                         /* If interrupts are enabled */
    {
        if (config->Interrupts.Buffer)
            config->I2Cx->CR2 |= I2C_CR2_ITBUFEN;
        if (config->Interrupts.Error)
            config->I2Cx->CR2 |= I2C_CR2_ITERREN;
        if (config->Interrupts.Event)
            config->I2Cx->CR2 |= I2C_CR2_ITEVTEN;
    }

    /* Configure DMA (Disable, TX DMA, RX DMA) */
    config->I2Cx->CR2 &= ~I2C_CR2_DMAEN; // Clear DMA enable bit
    if (config->DMA_Control.Disable == 0)
    {
        if (config->DMA_Control.TX_DMA_Enable || config->DMA_Control.RX_DMA_Enable)
        {
            I2C_EnableDMA(config->I2Cx); /* Enable DMA for I2C if TX or RX DMA is enabled */
        }
        else
        {
            I2C_DisableDMA(config->I2Cx); /* Disable DMA if not needed */
        }
    }

    /* Configure I2C Speed Mode (Standard or Fast Mode) */
    if (config->speed_mode.FM_Mode)
    {
        /*
         * APB1 clock = 42 MHz
         * I2C Fast Mode formula for CCR:
         *   - Fast mode: T_high + T_low = CCR * (Tpclk1)
         *   - Set CCR value by dividing T_high + T_low by the clock period (Tpclk1 = 1/APB1 clock)
         *   - Also, enable duty cycle control for fast mode.
         */
        config->I2Cx->CR2 = 30;                        /* APB1 clock frequency is 42 MHz */
        config->I2Cx->CCR = (1 << 15) | (1 << 14) | 5; /* Fast mode configuration */
        config->I2Cx->TRISE = 30;                      /* Maximum rise time for fast mode is configured as 300 ns */
    }
    else
    {
        /*
         * Standard Mode I2C Setup:
         *  - Standard mode CCR calculation: CCR = (APB1_CLK / (2 * I2C_SPEED_STANDARD))
         *  - TRISE = Maximum rise time (standard mode: 1000 ns)
         */
        config->I2Cx->CR2 = 25;    /* APB1 clock frequency is 42 MHz */
        config->I2Cx->CCR = 0x28;  /* Standard mode clock control */
        config->I2Cx->TRISE = 0x8; /* Maximum rise time for standard mode */
    }

    /* Set I2C Mode (Master or Slave) */
//    if (config->mode == I2C_MODE_MASTER)
//    {
//        /* Master mode configuration */
//        config->I2Cx->CCR = config->speed; /* Set clock speed for master mode */
//    }
//    else if (config->mode == I2C_MODE_SLAVE)
  //  {
        /* Slave mode configuration */
   //     config->I2Cx->OAR1 = (config->ownAddress << 1); /* Set own address for slave mode */
   // }
    /*Disable clock stretching*/
    config->I2Cx->CR1 |= I2C_CR1_NOSTRETCH;
    /* Enable I2C peripheral after configuration */
    config->I2Cx->CR1 |= I2C_CR1_PE;
}

/**
 * @brief  Generates an I2C start condition.
 * @param  I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, I2C3).
 * @retval 0 if successful, -1 if timeout occurs.
 * @note   This function sets the START bit in the CR1 register to initiate
 *         communication and waits until the start condition is generated.
 */
uint8_t I2C_Start(I2C_Config *config)
{
    int timeout = 1000;               // Correct variable name
    config->I2Cx->CR1 |= I2C_CR1_START;       /* Set the START bit to begin communication */
    //config->I2Cx->CR1 |= I2C_CR1_START;
    while (!(READ_BIT(config->I2Cx->SR1 ,I2C_SR1_SB))) // Wait for the start bit to be set
    {
        if (--timeout == 0)
        {
        	 I2C_Stop(config); // Stop if timeout occurs
        	return I2C_ERROR_TIMEOUT; // Return error code on timeout
        }

    }
    return I2C_OK; // Return success code
}

/**
 * @brief  Generates an I2C stop condition.
 * @param  I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, I2C3).
 * @note   This function sets the STOP bit in the CR1 register to terminate
 *         communication after a transmission or reception.
 */
void I2C_Stop(I2C_Config *config)
{
    config->I2Cx->CR1 |= I2C_CR1_STOP; /* Set the STOP bit to end communication */
}


/**
 * @brief  Sends the I2C address with the read/write direction.
 * @param  I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, I2C3).
 * @param  address: 7-bit address of the I2C device.
 * @param  direction: Direction of communication (Read/Write).
 * @return I2C_Status: Returns the status of the operation (I2C_OK, I2C_ERROR).
 * @note   This function sends the 7-bit address along with the direction (R/W bit)
 *         and waits until the address is acknowledged by the slave.
 */
I2C_Status I2C_WriteAddress(I2C_Config *config, uint16_t address, uint8_t direction)
{

    // Set the TxRxState based on the direction
    if (direction == I2C_READ)
    {
        config->TxRxState = I2C_BUSY_IN_RX;
    }
    else
    {
        config->TxRxState = I2C_BUSY_IN_TX;
    }

    // Send a 7-bit address  with direction bit
    WRITE_REG(config->I2Cx->DR ,((address << 1) | direction)); /* Send the 7-bit address and the direction bit */
    while (!READ_BIT(config->I2Cx->SR1 , I2C_SR1_ADDR))
        ; // Wait until the address is sent/acknowledgemet of addr

    I2C_ClearADDRFlag(config->I2Cx,config); // Clear the ADDR flag

    return I2C_OK;
}

/**
 * @brief  Transmits data as a master to the specified slave.
 * @param  config: Pointer to the I2C_Config structure that contains
 *         the configuration information for the I2C peripheral.
 * @param  address: 7-bit address of the slave device.
 * @param  data: Pointer to the data to be transmitted.
 * @param  size: Size of the data buffer to be transmitted(no of bytes to transmit).
 * @param  timeout: Timeout value for the transmission.
 * @return I2C_Status: Returns the status of the transmission.
 *         - I2C_OK: Transmission successful.
 *         - I2C_BUSY: I2C bus is busy.
 *         - I2C_NACK_RECEIVED: NACK received from slave.
 *         - I2C_ERROR_TIMEOUT: Timeout occurred.
 *         - I2C_ERROR_BUS: Bus error detected.
 *
 * @note   This function transmits data from the master to the specified
 *         slave by writing data byte-by-byte to the I2C data register (DR).
 */
I2C_Status I2C_Master_Transmit(I2C_Config *config, uint16_t address, const uint8_t *data, uint16_t size, uint32_t timeout)
{
    I2C_Status status;

    // Start I2C communication
    status = I2C_Start(config);
    if (status != I2C_OK)
    {
        return status; // Return if start condition fails
    }

    // Send the address with the transmitter direction
    status = I2C_WriteAddress(config, address, I2C_Direction_Transmitter);
    if (status != I2C_OK)
    {
        I2C_Stop(config); // Generate stop condition on failure
        return status;
    }

    // Transmit the data
    for (uint16_t i = 0; i < size; i++)
    {
        uint32_t TXE_timeout = timeout; // Reset timeout for each byte

        WRITE_REG(config->I2Cx->DR, data[i]); // Write data to the data register

