MuskaanJain2021/Mastering_STM32/STM32F407VGT6_DRIVERS/I2C_DRIVER/I2C.c
        // Wait for TXE (Transmit buffer empty)
        while (!(READ_BIT(config->I2Cx->SR1, I2C_SR1_TXE)))
        {
            if (--TXE_timeout == 0)
            {
                I2C_Stop(config); // Stop if timeout occurs
                return I2C_ERROR_TIMEOUT;
            }

            // Check for errors
            if (READ_BIT(config->I2Cx->SR1, I2C_SR1_AF))
            {
                // Clear the Acknowledge failure flag
                CLEAR_BIT(config->I2Cx->SR1, I2C_SR1_AF);
                I2C_Stop(config);
                return I2C_NACK_RECEIVED;
            }
            if (READ_BIT(config->I2Cx->SR1, I2C_SR1_BERR))
            {
                // Clear the Bus error flag
                CLEAR_BIT(config->I2Cx->SR1, I2C_SR1_BERR);
                I2C_Stop(config);
                return I2C_ERROR_BUS;
            }
        }
    }

    //After sending the last byte, wait for BTF (Byte transfer finished)
    uint32_t BTF_timeout = timeout;
    while (!(READ_BIT(config->I2Cx->SR1, I2C_SR1_BTF)))
    {
        if (--BTF_timeout == 0)
        {
            I2C_Stop(config);
            return I2C_ERROR_TIMEOUT;
        }
        // Check for any errors
        if (READ_BIT(config->I2Cx->SR1, I2C_SR1_AF)) {
                // Clear the Acknowledge failure flag
             CLEAR_BIT(config->I2Cx->SR1, I2C_SR1_AF);
             I2C_Stop(config);
             return I2C_NACK_RECEIVED;
            }
        if (READ_BIT(config->I2Cx->SR1, I2C_SR1_BERR)) {
                // Clear the Bus error flag
             CLEAR_BIT(config->I2Cx->SR1, I2C_SR1_BERR);
             I2C_Stop(config);
             return I2C_ERROR_BUS;
            }
    }

    // Generate stop condition
    I2C_Stop(config);



    return I2C_OK;
}
/**
 * @brief  Receives a block of data in master mode from a specific I2C slave.
 * @param  config: Pointer to the I2C_Config structure that contains
 *                 the configuration information for the I2C peripheral.
 * @param  address: 7-bit address of the I2C slave device.
 * @param  data: Pointer to the buffer where the received data will be stored.
 * @param  size: Number of bytes to receive.
 * @param  timeout: Timeout value for the reception process.
 * @return I2C_Status: Returns the status of the reception.
 *         - I2C_OK: Reception successful.
 *         - I2C_ERROR_TIMEOUT: Timeout occurred.
 *         - I2C_NACK_RECEIVED: NACK received from the slave device.
 *         - I2C_ERROR_BUS: Bus error detected.
 *
 * @note   This function performs a complete I2C read sequence in master mode.
 *         - Generates a START condition.
 *         - Sends the slave address with the read bit.
 *         - Reads the specified number of bytes from the slave.
 *         - Generates a STOP condition after reception.
 */
I2C_Status I2C_Master_Receive(I2C_Config *config, uint16_t address, uint8_t *data, uint16_t size, uint32_t timeout)
{
    I2C_TypeDef *I2Cx = config->I2Cx;
    I2C_Status status;

    // Start I2C communication
    status = I2C_Start(config);
    if (status != I2C_OK)
    {
        return status; // Return if start condition fails
    }

    // Send the slave address with the read direction
    status = I2C_WriteAddress(config, address, I2C_READ);
    if (status != I2C_OK)
    {
        I2C_Stop(config); // Generate stop condition on failure
        return status;
    }

    // Clear ADDR flag
    I2C_ClearADDRFlag(I2Cx, config);

    if (size == 1)
    {
        // Single-byte reception
    	I2C_AcknowledgeConfig(I2Cx,DISABLE);
       // CLEAR_BIT(I2Cx->CR1, I2C_CR1_ACK); // Disable ACK

        // Wait for RXNE (Receive Buffer Not Empty)
        uint32_t RXNE_timeout = timeout;
        while (!(READ_BIT(I2Cx->SR1, I2C_SR1_RXNE)))
        {
            if (--RXNE_timeout == 0)
            {
                I2C_Stop(config); // Stop on timeout
                return I2C_ERROR_TIMEOUT;
            }
        }

        *data = (uint8_t)(I2Cx->DR & 0xFF); // Read data

        I2C_Stop(config); // Generate stop condition
        I2C_AcknowledgeConfig(I2Cx,ENABLE);
        //SET_BIT(I2Cx->CR1, I2C_CR1_ACK); // Re-enable ACK
    }
    else if (size == 2)
    {
        // Two-byte reception
        CLEAR_BIT(I2Cx->CR1, I2C_CR1_ACK); // Disable ACK
        SET_BIT(I2Cx->CR1, I2C_CR1_POS);  // Enable POS bit

        // Wait for BTF (Byte Transfer Finished)
        uint32_t BTF_timeout = timeout;
        while (!(READ_BIT(I2Cx->SR1, I2C_SR1_BTF)))
        {
            if (--BTF_timeout == 0)
            {
                I2C_Stop(config); // Stop on timeout
                return I2C_ERROR_TIMEOUT;
            }
        }

        I2C_Stop(config); // Generate stop condition

        // Read the two bytes
        data[0] = (uint8_t)(I2Cx->DR & 0xFF);
        data[1] = (uint8_t)(I2Cx->DR & 0xFF);

        I2C_AcknowledgeConfig(I2Cx,ENABLE); // Re-enable ACK
        CLEAR_BIT(I2Cx->CR1, I2C_CR1_POS); // Clear POS bit
    }
    else
    {
        // Multi-byte reception
        for (uint16_t i = 0; i < size; i++)
        {
            uint32_t RXNE_timeout = timeout;

            while (!(READ_BIT(I2Cx->SR1, I2C_SR1_RXNE))) // Wait for RXNE
            {
                if (--RXNE_timeout == 0)
                {
                    I2C_Stop(config); // Stop on timeout
                    return I2C_ERROR_TIMEOUT;
                }
            }

            data[i] = (uint8_t)(I2Cx->DR & 0xFF); // Read data

            if (i == size - 2)
            {
                I2C_AcknowledgeConfig(I2Cx,DISABLE); // Disable ACK for second-to-last byte
            }
        }

        I2C_Stop(config); // Generate stop condition
        I2C_AcknowledgeConfig(I2Cx,ENABLE); // Re-enable ACK
    }

    return I2C_OK;
}

/**
 * @brief  Slave mode receive function.
 * @param  config: Pointer to I2C_Config structure containing the configuration.
 * @param  data: Pointer to buffer to store received data.
 * @param  size: Number of bytes to receive.
 * @param  timeout: Timeout value for reception.
 * @retval I2C_Status: Reception status (OK or error).
 */
I2C_Status I2C_Slave_Receive(I2C_Config *config, uint8_t *data, uint16_t size, uint32_t timeout)
{
    I2C_TypeDef *I2Cx = config->I2Cx;
    while (size--)
    {
        uint32_t RXNE_timeout = timeout;
        while (!(READ_BIT(config->I2Cx->SR1, I2C_SR1_RXNE))) // Wait for RXNE (Receive buffer not empty)
        {
            if (--RXNE_timeout == 0)
            {
                return I2C_ERROR_TIMEOUT;
            }
            if (READ_BIT(I2Cx->SR1, I2C_SR1_OVR))
            {
                return I2C_ERROR_OVERRUN;
            }
            // Check for Stop condition
            if (READ_BIT(I2Cx->SR1, I2C_SR1_STOPF))
            {
                // Clear STOPF flag
                (void)I2Cx->SR1;
                WRITE_REG(I2Cx->CR1, I2Cx->CR1);
                return I2C_ERROR_STOP;
            }
        }
        *data++ = READ_REG(I2Cx->DR); // Read data
    }
    // Wait for Stop condition after receiving data
    uint32_t STOPF_timeout = timeout;
    while (!(READ_BIT(I2Cx->SR1, I2C_SR1_STOPF)))
    {
        if (--STOPF_timeout == 0)
        {
            return I2C_ERROR_TIMEOUT;
        }
        // Check for errors
        if (READ_BIT(I2Cx->SR1, I2C_SR1_OVR))
        {
            return I2C_ERROR_OVERRUN;
        }
        if (READ_BIT(I2Cx->SR1, I2C_SR1_BERR))
        {
            return I2C_ERROR_BUS;
        }
    }

    // Clear STOPF flag
    (void)I2Cx->SR1;
    WRITE_REG(I2Cx->CR1, I2Cx->CR1);
    return I2C_OK;
}


I2C_Status I2C_Master_Read_Byte(I2C_Config *config, uint8_t *data)
{
    I2C_TypeDef *I2Cx = config->I2Cx;
    uint32_t timeout = TIMEOUT_MAX;

    // Wait for the RXNE (Receive Buffer Not Empty) flag
    while (!(READ_BIT(I2Cx->SR1, I2C_SR1_RXNE)))
    {
        if (--timeout == 0)
        {
            return I2C_ERROR_TIMEOUT; // Return timeout error
        }
    }

    // Read the data from the data register
    *data = (uint8_t)(I2Cx->DR & 0xFF);

    return I2C_OK; // Return success
}

