MuskaanJain2021/Mastering_STM32/STM32F407VGT6_DRIVERS/I2C_DRIVER/I2C.c
I2C_Status I2C_Master_Send_Byte(I2C_Config *config, uint8_t data)
{
    I2C_TypeDef *I2Cx = config->I2Cx;
    uint32_t Byte_timeout = TIMEOUT_MAX;

    // Write data to DR
    WRITE_REG(I2Cx->DR, data);

    // Wait until TXE (Transmit Data Register Empty) flag is set
    while (!(READ_BIT(I2Cx->SR1, I2C_SR1_TXE)))
    {
        if (--Byte_timeout == 0)
        {
            return I2C_ERROR_TIMEOUT;
        }
        // Check for NACK
        if (READ_BIT(I2Cx->SR1, I2C_SR1_AF))
        {
            // Clear AF flag
            CLEAR_BIT(I2Cx->SR1, I2C_SR1_AF);
            return I2C_NACK_RECEIVED;
        }
    }

    return I2C_OK;
}


/**
 * @brief  Reads a single byte from a specific register of an I2C device.
 *
 * This function performs a complete I2C read sequence to read a single byte
 * from a register of an I2C slave device. It first generates a START condition,
 * sends the device address with the write bit to specify the register address,
 * generates a repeated START condition, sends the device address with the read bit,
 * reads the data byte from the slave, and generates a STOP condition.
 *
 * @param  config: Pointer to the `I2C_Config` structure containing the configuration
 *                 information for the I2C peripheral.
 * @param  device_address: 7-bit I2C address of the target slave device.
 * @param  reg_address: Register address within the slave device from which the data will be read.
 * @param  data: Pointer to a variable where the read data byte will be stored.
 *
 * @retval I2C_Status: Status of the read operation.
 *         - `I2C_OK`: Read operation completed successfully.
 *         - `I2C_ERROR_TIMEOUT`: Timeout occurred during communication.
 *         - `I2C_NACK_RECEIVED`: NACK received from the slave device.
 *         - `I2C_ERROR_BUS`: Bus error detected.
 *
 * @note
 * - Ensure that the I2C peripheral has been properly initialized before calling this function.
 * - The `device_address` should be the 7-bit address of the slave device (excluding the R/W bit).
 * - This function handles the generation of START, repeated START, and STOP conditions internally.
 * - The ACK bit is managed within the function to properly receive the last byte.
 */
I2C_Status I2C_Master_Read_Register(I2C_Config *config, uint8_t device_address, uint8_t reg_address, uint8_t *data)
{
    I2C_Status status;

    //Write the register address
    status = I2C_Start(config);
    if (status != I2C_OK)
        return status;

    status = I2C_WriteAddress(config, device_address, I2C_WRITE);
    if (status != I2C_OK)
        return status;

    status = I2C_Master_Send_Byte(config, reg_address);
    if (status != I2C_OK)
        return status;

    I2C_Stop(config);

    // Read the data from the register
    status = I2C_Start(config);
    if (status != I2C_OK)
        return status;

    status = I2C_WriteAddress(config, device_address, I2C_READ);
    if (status != I2C_OK)
        return status;
    I2C_AcknowledgeConfig(config->I2Cx,DISABLE);
    // Disable ACK before receiving the last byte
   // CLEAR_BIT(config->I2Cx->CR1, I2C_CR1_ACK);

    status = I2C_Master_Read_Byte(config, data);
    if (status != I2C_OK)
        return status;

    I2C_Stop(config);

    // Re-enable ACK
    //SET_BIT(config->I2Cx->CR1, I2C_CR1_ACK);
    I2C_AcknowledgeConfig(config->I2Cx,ENABLE);
    return I2C_OK;
}

/**
 * @brief  Writes a single byte to a specific register of an I2C device.
 *
 * This function performs a complete I2C write sequence to write a single byte
 * to a register of an I2C slave device. It generates a START condition,
 * sends the device address with the write bit, sends the register address,
 * writes the data byte, and generates a STOP condition.
 *
 * @param  config: Pointer to the `I2C_Config` structure containing the configuration
 *                 information for the I2C peripheral.
 * @param  device_address: 7-bit I2C address of the target slave device.
 * @param  reg_address: Register address within the slave device where the data will be written.
 * @param  data: The data byte to be written to the specified register.
 *
 * @retval I2C_Status: Status of the write operation.
 *         - `I2C_OK`: Write operation completed successfully.
 *         - `I2C_ERROR_TIMEOUT`: Timeout occurred during communication.
 *         - `I2C_NACK_RECEIVED`: NACK received from the slave device.
 *         - `I2C_ERROR_BUS`: Bus error detected.
 *
 * @note
 * - Ensure that the I2C peripheral has been properly initialized before calling this function.
 * - The `device_address` should be the 7-bit address of the slave device (excluding the R/W bit).
 * - This function handles the generation of START and STOP conditions internally.
 *
 */
I2C_Status I2C_Master_Write_Register(I2C_Config *config, uint8_t device_address, uint8_t reg_address, uint8_t data)
{

    I2C_Status status;

    status = I2C_Start(config);
    if (status != I2C_OK)
        return status;

    status = I2C_WriteAddress(config, device_address, I2C_WRITE);
    if (status != I2C_OK)
        return status;

    status = I2C_Master_Send_Byte(config, reg_address);
    if (status != I2C_OK)
        return status;

    status = I2C_Master_Send_Byte(config, data);
    if (status != I2C_OK)
        return status;

    I2C_Stop(config);

    return I2C_OK;
}


/**
 * @brief  Checks the I2C peripheral for any error conditions.
 * @param  I2Cx: Pointer to I2C peripheral.
 * @retval I2C_Status: Status of the I2C error (OK or specific error code).
 */
I2C_Status I2C_CheckError(I2C_TypeDef *I2Cx)
{
    if (READ_BIT(I2Cx->SR1, I2C_SR1_AF))
    {
        // Clear the AF flag by writing 0
        CLEAR_BIT(I2Cx->SR1, I2C_SR1_AF);
        return I2C_NACK_RECEIVED; // Acknowledge failure
    }
    if (READ_BIT(I2Cx->SR1, I2C_SR1_OVR))
    {
        CLEAR_BIT(I2Cx->SR1, I2C_SR1_OVR);
        return I2C_ERROR_OVERRUN; // Overrun error
    }
    if (READ_BIT(I2Cx->SR1, I2C_SR1_ARLO))
    {
        CLEAR_BIT(I2Cx->SR1, I2C_SR1_ARLO);
        return I2C_ARBITRATION_LOST; // arbitration loss error
    }
    if (READ_BIT(I2Cx->SR1, I2C_SR1_BERR))
    {
        CLEAR_BIT(I2Cx->SR1, I2C_SR1_BERR);
        return I2C_ERROR_BUS; // bus error
    }

    if (READ_BIT(I2Cx->SR1,I2C_SR1_TIMEOUT ))
    {
    	CLEAR_BIT(I2Cx->SR1, I2C_SR1_TIMEOUT);
    	return I2C_ERROR_TIMEOUT; // TIMEOUT error
    }
    return I2C_OK; // No error
}


/**
 * @brief  Checks if the bus is busy
 *
 * @param  I2Cx: I2C peripheral
 * @return I2C_Status: Status of the bus
 */
I2C_Status I2C_CheckBusBusy(I2C_TypeDef *I2Cx)
{
    if (READ_BIT(I2Cx->SR2, I2C_SR2_BUSY))
    {
        return I2C_BUSY;
    }
    return I2C_OK;
}

/**
 * @brief Checks the status of the specified I2C flag.
 * @param I2Cx: Pointer to the I2C peripheral (I2C1, I2C2, or I2C3).
 * @param flag: The I2C flag to check. Example flags:
 *         - I2C_SR1_TXE: Transmit buffer empty
 *         - I2C_SR1_RXNE: Receive buffer not empty
 *         - I2C_SR1_BTF: Byte transfer finished
 *         - I2C_SR1_ADDR: Address matched
 *         - I2C_SR1_STOPF: Stop condition detected
 *         - I2C_SR1_SB: Start bit generated
 *         - I2C_SR1_AF: Acknowledge failure
 * @return uint8_t: 1 if the flag is set, 0 if the flag is reset.
 */
//uint8_t I2C_GetFlagStatus(I2C_Config I2Cx, uint32_t flag)
//{
//    if (READ_BIT(I2Cx->SR1, flag) != 0)
//    {
//        return 1; /*Set the given flag*/
//    }
//    else
//    {
//        return 0; /*Reset the given flag*/
//    }
//}

/**
 * @brief  Enables or disables callback events (interrupts) for the I2C peripheral in slave mode.
 * @param  pI2Cx: Pointer to the I2C peripheral (I2C1, I2C2, or I2C3).
 * @param  config: Pointer to the I2C_Config structure containing the interrupt configuration.
 * @param  EnorDi: ENABLE to enable interrupts, DISABLE to disable.
 * @note   This function uses the I2C_Config structure to selectively enable or disable
 *         Error, Event, and Buffer interrupts for I2C communication.
 */
void I2C_SlaveEnableDisableCallbackEvents(I2C_TypeDef *pI2Cx, I2C_Config *config, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        /* Enable Event Interrupt if configured */
        if (config->Interrupts.Event)
            SET_BIT(pI2Cx->CR2, I2C_CR2_ITEVTEN);

        /* Enable Buffer Interrupt if configured */
        if (config->Interrupts.Buffer)
            SET_BIT(pI2Cx->CR2, I2C_CR2_ITBUFEN);

        /* Enable Error Interrupt if configured */
        if (config->Interrupts.Error)
            SET_BIT(pI2Cx->CR2, I2C_CR2_ITERREN);
    }
    else // Disable interrupts
    {
        /* Disable Event Interrupt */
        CLEAR_BIT(pI2Cx->CR2, I2C_CR2_ITEVTEN);

        /* Disable Buffer Interrupt */
        CLEAR_BIT(pI2Cx->CR2, I2C_CR2_ITBUFEN);

        /* Disable Error Interrupt */
        CLEAR_BIT(pI2Cx->CR2, I2C_CR2_ITERREN);
    }
}

/**
 * @brief Resets the I2C peripheral configuration to default values.
 *
 * This function resets the I2C peripheral to its default settings, including
 * speed mode, interrupts, and operational mode. The clock is also disabled
 * during the reset process.
 *
 * @param config Pointer to the I2C_Config structure that holds the configuration.
 */
void I2C_Reset(I2C_Config *config)
{
	 I2C_TypeDef *I2Cx = config->I2Cx;

	 // Disable the peripheral
	 CLEAR_BIT(I2Cx->CR1, I2C_CR1_PE);
    /* Set I2C speed mode to Fast Mode (FM_Mode) */
    config->speed_mode.SM_Mode = 0;
    config->speed_mode.FM_Mode = 1;

    /* Disable interrupts */
    config->Interrupts.Disable = 1;
    config->Interrupts.Error = 0;
    config->Interrupts.Event = 0;
    config->Interrupts.Buffer = 0;
    config->DMA_Control.TX_DMA_Enable = 0;
    config->DMA_Control.RX_DMA_Enable = 0;

    /* Set I2C mode to Master */
    config->mode = I2C_MODE_MASTER;

