MuskaanJain2021/Mastering_STM32/STM32F407VGT6_DRIVERS/I2C_DRIVER/I2C.c
    /* Disable I2C clock */
    I2C_Clock_Disable(config);
}

/**
 * @brief Closes the I2C data send operation.
 *
 * This function disables the necessary interrupts and resets the
 * internal state related to a transmission operation.
 *
 * @param config Pointer to the I2C_Config structure.
 */
void I2C_Close_SendData(I2C_Config *config) {
    CLEAR_BIT(config->I2Cx->CR2, I2C_CR2_ITBUFEN); // Disable Buffer interrupt
    CLEAR_BIT(config->I2Cx->CR2, I2C_CR2_ITEVTEN); // Disable Event interrupt

    config->TxRxState = I2C_READY;   // Reset I2C state
    config->TxBuffer = NULL;         // Clear transmit buffer
    config->Txsize = 0;              // Reset transmit size
}

/**
 * @brief Closes the I2C data receive operation.
 *
 * This function disables the necessary interrupts and resets the
 * internal state related to a reception operation.
 *
 * @param config Pointer to the I2C_Config structure.
 */
void I2C_Close_ReceiveData(I2C_Config *config) {
    CLEAR_BIT(config->I2Cx->CR2, I2C_CR2_ITBUFEN); // Disable Buffer interrupt
    CLEAR_BIT(config->I2Cx->CR2, I2C_CR2_ITEVTEN); // Disable Event interrupt

    config->TxRxState = I2C_READY;   // Reset I2C state
    config->RxBuffer = NULL;         // Clear receive buffer
    config->Rxsize = 0;              // Reset receive size
    config->Txsize = 0;              // Reset transmit size

    // Enable ACK if previously disabled
    if (READ_BIT(config->I2Cx->CR1, I2C_CR1_ACK) == 0) {
        I2C_AcknowledgeConfig(config->I2Cx, ENABLE);
    }
}
/**
 * @brief Application Event Callback.
 *
 * This function is used to notify the application of various I2C events.
 *
 * @param config Pointer to the I2C_Config structure.
 * @param event Event ID to notify the application.
 */
__weak void I2C_ApplicationEventCallback(I2C_Config *config, uint8_t event) {
    // User can override this function in their application
}

/**
 * @brief Configures NVIC for I2C interrupts.
 *
 * @param IRQNumber IRQ number to configure.
 * @param IRQPriority Priority to set for the IRQ.
 * @param EnorDi Enable or disable the interrupt.
 */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t IRQPriority, uint8_t EnorDi) {
    if (EnorDi == ENABLE) {
        NVIC->ISER[IRQNumber >> 5] |= (1 << (IRQNumber & 0x1F));
        NVIC->IP[IRQNumber] = (IRQPriority << 4);
    } else {
        NVIC->ICER[IRQNumber >> 5] &= ~(1 << (IRQNumber & 0x1F));
    }
}

/**
 * @brief Handles Master TXE (Transmit Buffer Empty) interrupt.
 *
 * This function manages the data transmission process during
 * an interrupt-driven transfer.
 *
 * @param config Pointer to the I2C_Config structure.
 */
void I2C_Master_Handle_TXE(I2C_Config *config) {
    if (config->Txsize > 0) {
        // Load the data from TxBuffer to DR
        WRITE_REG(config->I2Cx->DR, *config->TxBuffer);
        config->TxBuffer++;
        config->Txsize--;
    } else {
        // Transmission complete, close send operation
        I2C_Close_SendData(config);
    }
}

/**
 * @brief Handles Master RXNE (Receive Buffer Not Empty) interrupt.
 *
 * This function manages the data reception process during
 * an interrupt-driven transfer.
 *
 * @param config Pointer to the I2C_Config structure.
 */
void I2C_Master_Handle_RXNE(I2C_Config *config) {
    if (config->Rxsize == 1) {
        // Single byte reception
        *config->RxBuffer = config->I2Cx->DR;
        config->Rxsize--;
    }
    if(config->Rxsize > 1)
    {
    	if (config->Rxsize == 2)
    	{
    	   // Disable ACK and prepare for the last 2 bytes
    		I2C_AcknowledgeConfig(config->I2Cx, DISABLE);
    	}
    	/*Read DR*/
    	*config->RxBuffer = config->I2Cx->DR;
    	config->RxBuffer++;
    	config->Rxsize--;

    }

    if (config->Rxsize == 0) {
    	// If repeated start is not required, generate stop condition
    	if (config->Repeat_SR != I2C_DISABLE_SR)
    	{
    	    I2C_Stop(config);
    	}
    	// Close the receive operation and notify application
        I2C_Close_ReceiveData(config);

        // Notify application of completion
        I2C_ApplicationEventCallback(config, I2C_EV_RX_CMPLT);
    }
}

/**
 * @brief Sets error flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @param flags: Error flags to be set
 */
void I2C_SetErrorFlags(I2C_Config *config, uint16_t flags)
{
    config->I2Cx->SR1 |= flags;
}

/**
 * @brief Clears error flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @param flags: Error flags to be cleared
 */
void I2C_ClearErrorFlags(I2C_Config *config, uint16_t flags)
{
    config->I2Cx->SR1 &= ~flags;
}

/**
 * @brief Gets error flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @return uint16_t: Current error flags
 */
uint16_t I2C_GetErrorFlags(I2C_Config *config)
{
    return config->I2Cx->SR1;
}



/**
 * @brief Clears event flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @param flags: Event flags to be cleared
 */
void I2C_ClearEventFlags(I2C_Config *config, uint16_t flags)
{
    config->I2Cx->CR2 &= ~flags;
}

/* Event Flags API: Set Event Flags */
/**
 * @brief Sets event flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @param flags: Event flags to be set
 */
void I2C_SetEventFlags(I2C_Config *config, uint16_t flags) {
    config->TxRxState |= flags; // Combine existing state with new flags
}

/* Event Flags API: Get Event Flags */
/**
 * @brief Gets event flags for the I2C peripheral
 *
 * @param config: Pointer to the I2C_Config structure
 * @return uint16_t: Current event flags
 */
uint16_t I2C_GetEventFlags(I2C_Config *config) {
    return config->TxRxState; // Return the current state flags
}

